In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('cart.csv', parse_dates=['date'])
df

        date    name  amount  price
0 2021-03-01  carrot     7.0   5.73
1 2021-03-01     egg    12.0   1.70
2 2021-03-01    milk     NaN   3.57
3 2021-03-01  potato     2.0    NaN
4        NaT  tomato     6.0   1.52
5 2021-03-02  potato     3.0   2.17
6 2021-03-03     NaN     5.0   3.68

In [4]:
df['amount'].astype('Int32')

0       7
1      12
2    <NA>
3       2
4       6
5       3
6       5
Name: amount, dtype: Int32

In [5]:
df.isnull()

    date   name  amount  price
0  False  False   False  False
1  False  False   False  False
2  False  False    True  False
3  False  False   False   True
4   True  False   False  False
5  False  False   False  False
6  False   True   False  False

In [6]:
df.isnull().any(axis=1)

0    False
1    False
2     True
3     True
4     True
5    False
6     True
dtype: bool